{
  "source_id": "ew_section21_guidance",
  "fetched_at": "2025-12-05T01:56:07.484Z",
  "jurisdiction": "england-wales",
  "category": "eviction",
  "raw_text": "Evicting tenants in England: Section 21 and Section 8 notices - GOV.UK\nCookies on GOV.UK\nWe use some essential cookies to make this website work.\nWe’d like to set additional cookies to understand how you use GOV.UK, remember your settings and improve government services.\nWe also use cookies set by other sites to help us deliver content from their services.\nYou have accepted additional cookies.  You can  change your cookie settings  at any time.\nYou have rejected additional cookies.  You can  change your cookie settings  at any time.\nAccept additional cookies\nReject additional cookies\nView cookies\nHide cookie message\nSkip to main content\nGOV.UK\nNavigation menu\nMenu\nMenu\nServices and information\nBenefits\nBirths, death, marriages and care\nBusiness and self-employed\nChildcare and parenting\nCitizenship and living in the UK\nCrime, justice and the law\nDisabled people\nDriving and transport\nEducation and learning\nEmploying people\nEnvironment and countryside\nHousing and local services\nMoney and tax\nPassports, travel and living abroad\nVisas and immigration\nWorking, jobs and pensions\nGovernment activity\nDepartments\nDepartments, agencies and public bodies\nNews\nNews stories, speeches, letters and notices\nGuidance and regulation\nDetailed guidance, regulations and rules\nResearch and statistics\nReports, analysis and official statistics\nPolicy papers and consultations\nConsultations and strategy\nTransparency\nData, Freedom of Information releases and corporate reports\nSearch GOV.UK\n&times;\nSearch GOV.UK\nSearch\nSearch GOV.UK\nSearch\nHome\nHousing and local services\nBeing a landlord and renting out a room\nEvicting tenants in England\nSkip contents\nContents\nOverview\nSection 21 and Section 8 notices\nStandard possession orders\nAccelerated possession orders\nPossession hearings and orders\nEviction notices and bailiffs\nHarassment and illegal evictions\nSection 21 and Section 8 notices\nThe rules about private renting  are changing on 1 May 2026.  Check how this will affect giving tenants notice to leave your property .\nYou can evict tenants who have an  assured shorthold tenancy  using a Section 21 or Section 8 notice, or both.\nUse a Section 8 notice if your tenants have broken the terms of the tenancy.\nBefore serving notice, try to resolve any disputes with your tenant instead. For example, work with your tenant to  manage rent arrears  or  agree a rent repayment plan  if they have rent arrears.\nWhen you serve a notice, you may want to let your tenant know they can get free legal advice from the  Housing Loss Prevention Advice Service .\nSection 21 notice of seeking possession\nYou can use a Section 21 notice to evict your tenants either:\nafter a fixed term tenancy ends - if there’s a written contract\nduring a tenancy with no fixed end date - known as a ‘periodic’ tenancy\nYou can  get legal advice  if you do not know which notice to give.\nWhen you cannot use a Section 21 notice\nYou cannot use a Section 21 notice if any of the following apply:\nit’s less than 4 months since the tenancy started, or the fixed term has not ended, unless there’s a clause in the contract which allows you to do this\nthe property is categorised as a  house in multiple occupation  ( HMO ) and does not have a  HMO  licence from the council\nthe tenancy started after April 2007 and you have not put the tenants’ deposit in a  deposit protection scheme\nthe council has served an improvement notice on the property in the last 6 months\nthe council has served a notice in the last 6 months that says it will do emergency works on the property\nyou have not repaid any unlawful fees or deposits that you charged the tenant - read the guidance for landlords on the  Tenant Fees Act 2019\nYou also cannot use a Section 21 notice if you have not given the tenants copies of:\nthe property’s  Energy Performance Certificate\nthe government’s  ‘How to rent’ guide\na current  gas safety certificate  for the property, if gas is installed\nYou must have given your tenants the gas safety certificate and the ‘How to rent’ guide before they moved in.\nYou must have given your tenants a copy of the property’s Energy Performance Certificate before they rented the property.\nGiving tenants a Section 21 notice\nYou must use  form 6a of the assured tenancy forms , or you can write your own Section 21 notice that includes the same information.\nHow much notice you need to give\nA Section 21 notice must give your tenants at least 2 months’ notice to leave your property.\nYou may need to give a longer notice period if you have a ‘contractual’ periodic tenancy. This is a fixed term tenancy that has ended, but included a clause to continue as a periodic tenancy. The amount of notice must be the same as the rental period, if this is more than 2 months. For example, if your tenant pays rent every 3 months, you must give 3 months’ notice.\nSection 8 notice of seeking possession\nTo give your tenants notice using a Section 8, you must fill in  form 3 of the assured tenancy forms .\nYou can give between 2 weeks’ and 2 months’ notice depending on which terms they have broken.\nYou can  get legal advice  on how to fill in a Section 8 with the correct notice periods and how to give it to your tenants.\nAfter you give notice\nKeep proof that you gave notice to your tenants - either:\nfill in the  certification of service form (N215)\nwrite “served by [your name] on [the date]” on the notice\nIf your tenants do not leave by the specified date, you can use your completed N215 or notice to:\napply for a possession order\napply for an accelerated possession order  - this can only be used if you’ve given your tenants a Section 21 notice\nPrevious\n:\nOverview\nNext\n:\nStandard possession orders\nView a printable version of the whole guide\nRelated content\nPossession Claim Online: recover property\nPrivate renting for tenants: evictions in England\nTenancy agreements: a guide for landlords (England and Wales)\nBailiff powers when they visit your home\nExplore the topic\nBeing a landlord and renting out a room\nRepossessions, homelessness, emergency housing and evictions\nElsewhere on the web\nResidential Landlords Association\nIs this page useful?\nMaybe\nYes  this page is useful\nNo  this page is not useful\nThank you for your feedback\nReport a problem with this page\nHelp us improve GOV.UK\nDon’t include personal or financial information like your National Insurance number or credit card details.\nThis field is for robots only. Please leave blank\nWhat were you doing?\nWhat went wrong?\nSend\nCancel\nHelp us improve GOV.UK\nTo help us improve GOV.UK, we’d like to know more about your visit today.\nPlease fill in this survey (opens in a new tab  and requires JavaScript ) .\nCancel\nServices and information\nBenefits\nBirths, death, marriages and care\nBusiness and self-employed\nChildcare and parenting\nCitizenship and living in the UK\nCrime, justice and the law\nDisabled people\nDriving and transport\nEducation and learning\nEmploying people\nEnvironment and countryside\nHousing and local services\nMoney and tax\nPassports, travel and living abroad\nVisas and immigration\nWorking, jobs and pensions\nGovernment activity\nDepartments\nNews\nGuidance and regulation\nResearch and statistics\nPolicy papers and consultations\nTransparency\nHow government works\nGet involved\nSupport links\nHelp\nPrivacy\nCookies\nAccessibility statement\nContact\nTerms and conditions\nRhestr o Wasanaethau Cymraeg\nGovernment Digital Service\nAll content is available under the  Open Government Licence v3.0 , except where otherwise stated\n© Crown copyright",
  "hash": "cce50b96bd410ba180135ec9d10ac9e8c629784b7b1dad71e89524b4da2eb2c7"
}